
class Crawlerconfigs:
    city = {'제주':7, '전주':28, '경주':29, '서울':36, '화성':31, '부산':35, '수원':30, '강원':37, '인천':45, '강화':51}
    beach = {'강원':37, '경주':29, '인천':45, '제주':7, '부산':35, '강화':51}
    mountain = {'제주':7, '경주':29, '서울':36, '화성':31, '부산':35, '수원':30, '강원':37, '인천':45, '강화':51}
    spa = mountain
    camping = city
    Nlandscape = {'제주':7, '경주':29, '화성':31, '부산':35, '강원':37, '인천':45}
    historic = {'전주':28, '경주':29, '서울':36, '화성':31, '부산':35, '수원':30, '강원':37, '강화':51}
    park = city
    museum = city
    art_gallery = city
    sightseeing = city
    land_mark = city
    theme_park = {'제주':7, '전주':28, '경주':29, '서울':36, '화성':31, '부산':35, '강원':37, '인천':45}
    market = {'제주':7, '전주':28, '서울':36, '화성':31, '부산':35, '수원':30, '강원':37, '인천':45, '강화':51}
    amusement_park = {'제주':7, '전주':28, '경주':29, '서울':36, '화성':31, '부산':35, '수원':30, '강원':37, '인천':45, '용인':99}
    stadium = {'제주':7, '전주':28, '서울':36, '부산':35, '수원':30, '강원':37, '인천':45, '대구':99, '광주':99}
    load = {'제주':7, '서울':36, '부산':35, '수원':30, '강원':37, '인천':45}
    shopping = {'제주':7, '서울':36, '화성':31, '부산':35, '수원':30, '인천':45}
    arboretum = city
    zoo = {'제주':7, '전주':28, '경주':29, '서울':36, '화성':31, '부산':35, '강원':37, '인천':45, '강화':51}

    
    info = {'7':'1000043115101', '28':'1000043129101', '29':'1000043135101', '30':'1000043614101'}