
class Crawlerconfigs:
    # 여행종류 리스트
    p_beach = ['바다', '깨끗한 바다', '해수욕장', '수영', '서핑', '카약', '낚시', '요트', '윈드서핑', '제트스키', '수상스키',
    '웨이크보드', '스킨 스쿠버', '래프팅']
    p_mountain_leisure = ['패러글라이딩', '써바이벌', '산악ATV', '산악자전거']
    p_mountain = ['산', '등산', '단풍', '단풍 놀이', '단풍 구경', '절', '사찰', '꽃놀이']
    p_Nlandscape = ['자연 경관', '섬']
    p_stadium = ['경기장', '축구장', '야구장', '경기장 구경']
    p_museum = ['박물관', '미술관', '전시관', '문학관']
    p_amusement_park = ['동물원', '식물원', '수목원']
    p_sports = ['축구', '야구', '농구', '배구', '스포츠']


    # 여행지 리스트
    city = {'제주':7, '전주':28, '경주':29, '서울':36, '화성':31, '부산':35, '수원':30, '강원':37, '인천':45, '강화':51}
    beach = {'강원':37, '경주':29, '인천':45, '제주':7, '부산':35, '강화':51}
    mountain = {'제주':7, '경주':29, '서울':36, '화성':31, '부산':35, '수원':30, '강원':37, '인천':45, '강화':51}
    spa = mountain
    camping = city
    Nlandscape = {'제주':7, '경주':29, '화성':31, '부산':35, '강원':37, '인천':45}
    historic = {'전주':28, '경주':29, '서울':36, '화성':31, '부산':35, '수원':30, '강원':37, '강화':51}
    park = city
    museum = city
    art_gallery = city
    sightseeing = city
    land_mark = city
    theme_park = {'제주':7, '전주':28, '경주':29, '서울':36, '화성':31, '부산':35, '강원':37, '인천':45}
    market = {'제주':7, '전주':28, '서울':36, '화성':31, '부산':35, '수원':30, '강원':37, '인천':45, '강화':51}
    amusement_park = {'제주':7, '전주':28, '경주':29, '서울':36, '화성':31, '부산':35, '수원':30, '강원':37, '인천':45, '용인':99}
    stadium = {'제주':7, '전주':28, '서울':36, '부산':35, '수원':30, '강원':37, '인천':45, '대구':99, '광주':99}
    load = {'제주':7, '서울':36, '부산':35, '수원':30, '강원':37, '인천':45}
    shopping = {'제주':7, '서울':36, '화성':31, '부산':35, '수원':30, '인천':45}
    arboretum = city
    zoo = {'제주':7, '전주':28, '경주':29, '서울':36, '화성':31, '부산':35, '강원':37, '인천':45, '강화':51}
    leisure = {}

    
    info = {'7':'1000043115101',
            '28':'1000043129101',
            '29':'1000043135101',
            '30':'1000043614101',
            '31':'1000047881101',
            '35':'1000060452101',
            '36':'1000056139101',
            '37':'1000060540101',
            '45':'1000072355101',
            '51':'1000078061101',
            '99':None}


    # 도시
    metropolitans = [
    '서울', '서울시', '서울특별시', '대구', '대구시', '대구광역시', '대전', '대전시', '대전광역시', '부산', '부산시', '부산광역시',
    '인천', '인천시', '인천광역시', '광주', '광주시', '광주광역시', '울산', '울산시', '울산광역시', '제주', '제주시', '제주도', '서귀포시', '전라도', '경상도', '경기도', '충청도',
    '광명', '광명시', '수원', '수원시', '창원', '창원시', '용인', '용인시', '평택', '평택시', '청주', '청주시', '파주', '파주시', '전주', '전주시', '안산', '안산시', '시흥', '시흥시',
    '고양', '고양시', '진주', '진주시', '천안', '천안시', '강릉', '강릉시', '양산', '양산시', '의왕', '의왕시', '부천', '부천시', '순천', '순천시', '하남', '하남시', '원주', '원주시',
    '성남', '성남시', '과천', '과천시', '포항', '포항시', '충주', '충주시', '안양', '안양시', '여수', '여수시', '광양', '광양시', '군산', '군산시', '김포', '김포시', '통영', '통영시',
    '나주', '나주시', '삼척', '삼척시', '김천', '김천시', '서산', '서산시', '아산', '아산시', '공주', '공주시', '문경', '문경시', '김해', '김해시', '안동', '안동시', '목포', '목포시',
    '춘천', '춘천시', '이천', '이천시', '군포', '군포시', '양주', '양주시', '오산', '오산시', '구리', '구리시', '포천', '포천시', '경기도광주', '남양주', '동두천']


    # 행정구역
    Governments = [
    '강남구', '강동구', '강북구', '강서구', '관악구', '광진구', '구로구', '금천구', '노원구', '도봉구', '동대문구', '동작구', '마포구', '미지정', '서대문구', '서초구', '성동구', '성북구', '송파구', '양천구', '영등포구', '용산구', '은평구', '종로구', '중구', '중랑구',
    '서구', '동구', '영도구', '부산진구', '동래구', '남구', '북구', '해운대구', '사하구', '금정구', '연제구', '수영구', '사상구', '기장군',
    '미추홀 구', '인천 남구', '연수구', '남동구', '부평구', '계양구', '강화군', '옹진군', '수성구', '달서구', '달성군', '울주군', '유성구', '대덕구', '광산구',
    '장안구', '권선구', '팔달구', '영통구', '덕양구', '일산동구', '일산서구', '처인구', '기흥구', '수지구', '수정구', '중원구', '분당구', '상록구', '단원구', '만안구', '동안구']